#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-TKY12dr7rJff3mqe

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.module.container_registries.digitalocean_container_registry.api_registry: Refreshing state... [id=foreign-language-reader-api]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/048581440bbcef4defc3dc4efa4224416862]
module.infrastructure.module.content.kubernetes_namespace.content: Refreshing state... [id=content]
module.infrastructure.kubernetes_namespace.prod: Refreshing state... [id=prod]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.kubernetes_namespace.qa: Refreshing state... [id=qa]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.kubernetes_ingress.foreign_language_reader_ingress: Refreshing state... [id=default/foreign-language-reader-ingress]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.infrastructure.module.container_registries.digitalocean_container_registry_docker_credentials.api will be created
  + resource "digitalocean_container_registry_docker_credentials" "api" {
      + credential_expiration_time = (known after apply)
      + docker_credentials         = (sensitive value)
      + expiry_seconds             = 1576800000
      + id                         = (known after apply)
      + registry_name              = "foreign-language-reader-api"
      + write                      = false
    }

  # module.infrastructure.module.container_registries.kubernetes_secret.api will be created
  + resource "kubernetes_secret" "api" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "kubernetes.io/dockerconfigjson"

      + metadata {
          + generation       = (known after apply)
          + name             = "docker-cfg-api"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"] will be created
  + resource "digitalocean_record" "kubernetes_subdomain_dns" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "api"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "157.230.199.217"
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["kibana"] will be created
  + resource "digitalocean_record" "kubernetes_subdomain_dns" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "kibana"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "157.230.199.217"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
